- readme overhaul
